In [1]:
import pandas as pd

# Pandas - Dataframework and Series

Pandas are powerful data manipulation library in python, Widely used for data analysis and data cleaning. It provides two primary data structures: Series and DataFrame. A series is one-dimentional array-like object, While a DataFrame is a two-dimensional, size-mutable,and potentially heterogeneous tabular data structure with labeled axes

### Series

In [2]:
#From List

data=[1,2,3,4,5]
series=pd.Series(data)
print("Series \n",series)

Series
 0    1
1    2
2    3
3    4
4    5
dtype: int64

In [3]:
#From Dictionary


data={'a':1,'b':2,'c':3}
series_dict=pd.Series(data)
print(series_dict)

a    1
b    2
c    3
dtype: int64

In [4]:
data=[10,20,30,40,50,60]
index=['A','B','C','D','E','F']
pd.Series(data,index=index)

A    10
B    20
C    30
D    40
E    50
F    60
dtype: int64

### DataFrame

In [5]:
data = {
    
    
    'NAME':['Rani','Shani','Vani','Rohini','Nandini'],
    'AGE':[30,45,25,55,35]
   
}
#Adding a Column
data['MILF'] = ['yes' if age > 35 else 'No' for age in data['AGE']]

df = pd.DataFrame(data)
df

      NAME  AGE MILF
0     Rani   30   No
1    Shani   45  yes
2     Vani   25   No
3   Rohini   55  yes
4  Nandini   35   No

In [6]:
print(type(df))

<class 'pandas.core.frame.DataFrame'>

In [11]:
df.loc[0][0]

'Rani'

In [9]:
df.iloc[1] #IndexLocation

NAME    Shani
AGE        45
MILF      yes
Name: 1, dtype: object

In [14]:
#Accessing A Specified Element

df.at[1,'MILF']

'yes'

In [15]:
df.at[1,'NAME']

'Shani'

In [19]:
#Accessing A Specified Element using iat

df.iat[3,2]

'yes'

In [22]:
#Adding a Column

df['CITY']=['Hyderabad','Bangalore','Kolkata','Chennai','Mumbai']

In [23]:
df

      NAME  AGE MILF       City       CITY
0     Rani   30   No  Hyderabad  Hyderabad
1    Shani   45  yes  Bangalore  Bangalore
2     Vani   25   No    Kolkata    Kolkata
3   Rohini   55  yes    Chennai    Chennai
4  Nandini   35   No     Mumbai     Mumbai

In [26]:
#Dropping Column

df.drop('City',axis=1)

      NAME  AGE MILF       CITY
0     Rani   30   No  Hyderabad
1    Shani   45  yes  Bangalore
2     Vani   25   No    Kolkata
3   Rohini   55  yes    Chennai
4  Nandini   35   No     Mumbai

In [27]:
df #Even After Drop we still have city column in our df

      NAME  AGE MILF       City       CITY
0     Rani   30   No  Hyderabad  Hyderabad
1    Shani   45  yes  Bangalore  Bangalore
2     Vani   25   No    Kolkata    Kolkata
3   Rohini   55  yes    Chennai    Chennai
4  Nandini   35   No     Mumbai     Mumbai

In [28]:
#Dropping Column once andfor all

df.drop('City',axis=1,inplace=True)

In [29]:
df #We dropped the column City for once and all

      NAME  AGE MILF       CITY
0     Rani   30   No  Hyderabad
1    Shani   45  yes  Bangalore
2     Vani   25   No    Kolkata
3   Rohini   55  yes    Chennai
4  Nandini   35   No     Mumbai